docs/hoverfly/bsf_data/loan/reqQueryLoanList_CustCode_L10563.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ret="http://com.tcs.bancs.gbp/ManageRetailLoanLegacy/RetailLoanLegacyBaseTypes" xmlns:typ="http://com.tcs.bancs.gbp/common/types">
   <soapenv:Header/>
   <soapenv:Body>
      <ret:QueryLoanListRequest>
         <ret:MessageHeader>
            <typ:MessageId>20210420T163109qw</typ:MessageId>
            <typ:Sender>BSF - Erick</typ:Sender>
            <typ:UserId>1</typ:UserId>
            <typ:OuId>GBANKBSFOU</typ:OuId>
            <typ:BranchId>1</typ:BranchId>
            <!--Optional:-->
            <typ:ChannelType>1</typ:ChannelType>
            <!--Optional:-->
            <typ:ServiceMode>1</typ:ServiceMode>
            <!--Optional:-->
            <typ:OperationType>1</typ:OperationType>
         </ret:MessageHeader>
         <ret:QueryLoanListInputDetails>
            <ret:CustomerCode>L10563</ret:CustomerCode>  <!-- K20294  //  N16539   -->
         </ret:QueryLoanListInputDetails>
      </ret:QueryLoanListRequest>
   </soapenv:Body>
</soapenv:Envelope>